app/controllers/private_messages_controller.rb

  def index
    @private_messages = PrivateMessage.all
---
SELECT "private_messages".* FROM "private_messages"

  def create
    @private_message = PrivateMessage.new(private_message_params)

    respond_to do |format|
      if @private_message.save
---
INSERT INTO "private_messages" ("created_at", "updated_at", "content", "content2", "anonymous_author") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-11-01 16:18:25.413834"], ["updated_at", "2018-11-01 16:18:25.413834"], ["content", "A"], ["content2", "AA"], ["anonymous_author", "AAA"]]

  def update
    respond_to do |format|
      if @private_message.update(private_message_params)
---
UPDATE "private_messages" SET "content" = $1, "content2" = $2, "updated_at" = $3 WHERE "private_messages"."id" = $4  [["content", "ah ah ca marche !!!! modifié"], ["content2", "ehhhh oui oui youpoi ca marche !!!! modifié"], ["updated_at", "2018-10-28 19:40:58.693177"], ["id", 31]]

  def destroy
    @private_message.destroy
---
DELETE FROM "private_messages" WHERE "private_messages"."id" = $1  [["id", 4]]

    def set_private_message
      @private_message = PrivateMessage.find(params[:id])
---
SELECT  "private_messages".* FROM "private_messages" WHERE "private_messages"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]