app/controllers/twitts_controller.rb

  def index
    @twitts = Twitt.all
---
SELECT "twitts".* FROM "twitts"

  def create
    @twitt = Twitt.new(twitt_params)

    respond_to do |format|
      if @twitt.save
---
INSERT INTO "twitts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-10-28 13:26:26.882015"], ["updated_at", "2018-10-28 13:26:26.882015"]]

  def destroy
    @twitt.destroy
---
DELETE FROM "twitts" WHERE "twitts"."id" = $1  [["id", 3]]

    def set_twitt
      @twitt = Twitt.find(params[:id])
---
SELECT  "twitts".* FROM "twitts" WHERE "twitts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]